#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. описание в комментарии к одноименной процедуре в модуле УправлениеДоступом.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:                Без ограничения.
	// Изменения:             Без ограничения.
	
	// Чтение, Добавление, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Перечисления.ДополнительныеЗначенияДоступа.ДоступРазрешен;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// Для внутреннего использования.
// 
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Проверка на наличие дублей по наименованию и виду номенклатуры.
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Режим",  "КонтрольПоНаименованию");
	ДополнительныеПараметры.Вставить("Ссылка", Ссылка);
	
	Дубли = ПоискИУдалениеДублей.НайтиДублиЭлемента("Справочник._ДемоНоменклатура", ЭтотОбъект, ДополнительныеПараметры);
	Если Дубли.Количество() > 0 Тогда
		Ошибка = НСтр("ru = 'Номенклатура с таким наименованием и видом уже существует.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Ошибка, , "Объект.Наименование", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

Процедура ПередЗаписью(Отказ)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	//ринат. эксперт
	Запрос.Текст =
	"ВЫБРАТЬ
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка.СуммаОплаты КАК СуммаДокумента,
	|	ПРЕДСТАВЛЕНИЕ(_ДемоСчетНаОплатуПокупателюТовары.Ссылка.Контрагент) КАК Контрагент,
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка.Дата КАК Дата,
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка КАК Ссылка,
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка.Номер КАК Номер,
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	_ДемоСчетНаОплатуПокупателюТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ СчетаНаОплату
	|ИЗ
	|	Документ._ДемоСчетНаОплатуПокупателю.Товары КАК _ДемоСчетНаОплатуПокупателюТовары
	|ГДЕ
	|	_ДемоСчетНаОплатуПокупателюТовары.Ссылка.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ВалютаДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЦеныНоменклатуры.Номенклатура,
	|	ЦеныНоменклатуры.Валюта,
	|	ЦеныНоменклатуры.Цена
	|ПОМЕСТИТЬ ЦеныНоменклатуры
	|ИЗ
	|	РегистрСведений._ДемоЦеныНоменклатуры.СрезПоследних(
	|			&Период,
	|			Валюта В
	|				(ВЫБРАТЬ
	|					СчетаНаОплату.ВалютаДокумента
	|				ИЗ
	|					СчетаНаОплату КАК СчетаНаОплату)) КАК ЦеныНоменклатуры
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЦеныНоменклатуры.Валюта,
	|	ЦеныНоменклатуры.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНаОплату.Контрагент,
	|	СчетаНаОплату.Дата КАК Дата,
	|	СчетаНаОплату.Ссылка,
	|	СчетаНаОплату.Номер,
	|	СчетаНаОплату.ВалютаДокумента,
	|	СчетаНаОплату.СуммаДокумента
	|ИЗ
	|	СчетаНаОплату КАК СчетаНаОплату
	|		ЛЕВОЕ СОЕДИНЕНИЕ ЦеныНоменклатуры КАК ЦеныНоменклатуры
	|		ПО СчетаНаОплату.ВалютаДокумента = ЦеныНоменклатуры.Валюта
	|			И СчетаНаОплату.Номенклатура = ЦеныНоменклатуры.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата";
	
	//РезультатВыполненияЗапроса = Запрос.Выполнить();
	
КонецПроцедуры
